Формы19/src/Documents/ПоступлениеОплаты/ПоступлениеОплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеОплаты</name>
  <registerRecords>AccumulationRegister.Проекты</registerRecords>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаОплаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

Формы19/src/AccumulationRegisters/Проекты/Проекты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Проекты</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>СуммаОплаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Формы19/src/Documents/ПоступлениеОплаты/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.Проекты.Записывать = Истина;
	Движение = Движения.Проекты.Добавить();
	Движение.Период = Дата;
	Движение.Проект = Проект;
	Движение.СуммаОплаты = СуммаОплаты;

КонецПроцедуры
